Comment: Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of WezTerm.
Identifier: com.github.jby-recipes.download.WezTerm
Input:
  NAME: WezTerm
MinimumVersion: '2.3'
Process:
- Arguments:
    asset_regex: .*\.zip$
    github_repo: wez/wezterm
  Processor: GitHubReleasesInfoProvider
- Arguments:
    filename: '%NAME%-%version%.zip'
  Processor: URLDownloader
- Processor: EndOfCheckPhase
- Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true
  Processor: Unarchiver
- Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/WezTerm-macos-20240203-110809-5046fc22/WezTerm.app'
    requirement: identifier "com.github.wez.wezterm" and anchor apple generic and
      certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13]
      /* exists */ and certificate leaf[subject.OU] = P4A6FU9KZ3
  Processor: CodeSignatureVerifier
- Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/%NAME%/WezTerm-macos-20240203-110809-5046fc22/WezTerm.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
  Processor: Versioner
