Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Installs the latest version of OverSight.
Identifier: com.github.autopkg-jby-recipes.install.OverSight
ParentRecipe: com.github.autopkg-jby-recipes.download.OverSight
MinimumVersion: 1.0.0

Input:
  NAME: OverSight

Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: InstallFromDMG
  Arguments:
    dmg_path: '%dmg_path%'
    items_to_copy:
    - destination_path: /Applications
      source_item: OverSight.app
