Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of OverSight and creates a package.
Identifier: com.github.autopkg-jby-recipes.pkg.OverSight
ParentRecipe: com.github.autopkg-jby-recipes.download.OverSight
MinimumVersion: 1.0.0

Input:
  NAME: OverSight

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/OverSight.app'
