Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of OverSight and imports it into Munki.
Identifier: com.github.autopkg-jby-recipes.munki.OverSight
ParentRecipe: com.github.autopkg-jby-recipes.download.OverSight
MinimumVersion: 1.0.0

Input:
  NAME: OverSight
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: "OverSight monitors a mac's mic and webcam, alerting the user when the internal mic is activated, or whenever a process accesses the webcam. "
    developer: Objective-See, LLC
    display_name: OverSight
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
