Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of BlockBlock and creates a package.
Identifier: com.github.autopkg-jby-recipes.pkg.BlockBlock
ParentRecipe: com.github.autopkg-jby-recipes.download.BlockBlock
MinimumVersion: 1.0.0

Input:
  NAME: BlockBlock

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/BlockBlock.app'
