Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of zoom.
Identifier: com.github.autopkg-jby-recipes.download.zoom
MinimumVersion: 1.0.0

Input:
  NAME: zoom

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.pkg'
    url: https://zoom.us/client/latest/Zoom.pkg?archType=arm64

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Zoom Video Communications, Inc. (BJ4HAAB9B3)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'
