Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Installs the latest version of zoom.
Identifier: com.github.autopkg-jby-recipes.install.zoom
ParentRecipe: com.github.autopkg-jby-recipes.download.zoom
MinimumVersion: 1.0.0

Input:
  NAME: zoom

Process:
- Processor: Installer
  Arguments:
    pkg_path: '%pathname%'
