Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of zoom and imports it into Munki.
Identifier: com.github.autopkg-jby-recipes.munki.zoom
ParentRecipe: com.github.autopkg-jby-recipes.download.zoom
MinimumVersion: 1.0.0

Input:
  NAME: zoom
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    blocking_applications:
    - ZoomUninstaller.app
    - zoom.app
    - Transcode.app
    - ZMScreenshot.app
    - CptHost.app
    - caphost.app
    catalogs:
    - testing
    description: ' '
    developer: Zoom Video Communications, Inc.
    display_name: zoom
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
