Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of KnockKnock and creates a package.
Identifier: com.github.autopkg-jby-recipes.pkg.KnockKnock
ParentRecipe: com.github.autopkg-jby-recipes.download.KnockKnock
MinimumVersion: 1.0.0

Input:
  NAME: KnockKnock

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/KnockKnock.app'
