Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of KnockKnock and imports it into Munki.
Identifier: com.github.autopkg-jby-recipes.munki.KnockKnock
ParentRecipe: com.github.autopkg-jby-recipes.download.KnockKnock
MinimumVersion: 1.0.0

Input:
  NAME: KnockKnock
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Enumerate persistently installed software
    developer: Objective-See, LLC
    display_name: KnockKnock
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
