Identifier: local.munki.PyCharmPro-arm64
Input:
  ARCHITECTURE: arm64
  MUNKI_REPO_SUBDIR: apps/%NAME%-%ARCHITECTURE%
  NAME: PyCharm Pro
  PLATFORM: macM1
  pkginfo:
    catalogs:
    - testing
    - production
    description: PyCharm is designed by programmers, for programmers, to provide all
      the tools you need for productive Python development.
    developer: JetBrains
    display_name: PyCharm Pro
    name: '%NAME%'
    supported_architectures:
    - '%ARCHITECTURE%'
    unattended_install: true
ParentRecipe: local.munki.PyCharmPro
ParentRecipeTrustInfo:
  non_core_processors:
    JetbrainsURLProvider:
      git_hash: a97d726863ea18b9c9754a5454a4c70fd0704b3f
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.mosen-recipes/JetBrains/JetbrainsURLProvider.py
      sha256_hash: 0b96b057eada699dd9463add37e7ef923169b88008ce9b76d5878306f38ed621
  parent_recipes:
    com.github.mosen.download.PyCharmPro:
      git_hash: e8b0a1d245a207b4317ac55db1bc741ac887a80a
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.mosen-recipes/JetBrains/PyCharmPro.download.recipe
      sha256_hash: 1625fd6e2613f79a88716ebff9da1cd53f4a1d34524783677d20a12f07cf53b0
    com.github.ygini.munki.PyCharmPro:
      git_hash: bafe0cda09170cb32e7348d008554018a540d974
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.ygini-recipes/JetBrains/PyCharmPro.munki.recipe
      sha256_hash: 46d0d0d2e8ca3915f76b34db49353cd2b03b4657326219ec3601b1c1d2649460
    local.munki.PyCharmPro:
      git_hash: 494b6ef7472dd8abaa518015d1042533aa637c02
      path: ~/src/ism/macstuff/Munki/RecipeOverrides/PyCharmPro.munki.recipe
      sha256_hash: ecfe98ceded8d6166cd94b45efb5d0590db63ded7a94cfc428c5b01e489ae2db
