Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Spectacle and imports it into Munki.
Identifier: com.github.autopkg-jby-recipes.munki.Spectacle
ParentRecipe: com.github.autopkg-jby-recipes.download.Spectacle
MinimumVersion: 1.0.0

Input:
  NAME: Spectacle
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Spectacle allows you to organize your windows without using a mouse.
    developer: Eric Czarny
    display_name: Spectacle
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
