Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Spectacle and creates a package.
Identifier: com.github.autopkg-jby-recipes.pkg.Spectacle
ParentRecipe: com.github.autopkg-jby-recipes.download.Spectacle
MinimumVersion: 1.0.0

Input:
  NAME: Spectacle

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/Spectacle.app'
