Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Spectacle.
Identifier: com.github.autopkg-jby-recipes.download.Spectacle
MinimumVersion: 1.0.0

Input:
  NAME: Spectacle

Process:
- Processor: SparkleUpdateInfoProvider
  Arguments:
    appcast_url: https://spectacleapp.com/updates/appcast.xml

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.zip'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/Spectacle.app'
    requirement: anchor apple generic and identifier "com.divisiblebyzero.Spectacle" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = P8TAT4Q25S)

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/%NAME%/Spectacle.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
