# This recipe requires the parent com.github.peshay.download.Mattermost recipe
# To add the repo for that: autopkg repo-add peshay-recipes

Identifier: com.github.jby.munki.Mattermost
Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: Mattermost
  os: mac-universal
  pkginfo:
    catalogs:
    - testing
    - production
    description: 'Mattermost: Open Source, Private Cloud Slack Alternative
        This recipe requires the parent com.github.peshay.download.Mattermost recipe
        To add the repo for that: autopkg repo-add peshay-recipes'
    developer: Mattermost, Inc.
    display_name: Mattermost
    name: '%NAME%'
    supported_architectures:
    - x86_64
    - arm64
    unattended_install: true
ParentRecipe: com.github.peshay.download.Mattermost
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.peshay.download.Mattermost:
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.peshay-recipes/Mattermost/Mattermost.download.recipe
      sha256_hash: b66beb06a38d20e572da385c41cb94ae60e838931b8a1c1747916f6d835efd3e
