Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of LuLu and imports it into Munki.
Identifier: com.github.autopkg-jby-recipes.munki.LuLu
ParentRecipe: com.github.autopkg-jby-recipes.download.LuLu
MinimumVersion: 1.0.0

Input:
  NAME: LuLu
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Shared-source macOS firewall.
    developer: Objective-See, LLC
    display_name: LuLu
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
