Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of LuLu.
Identifier: com.github.autopkg-jby-recipes.download.LuLu
MinimumVersion: 1.0.0

Input:
  NAME: LuLu

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: https://api.bitbucket.org/2.0/repositories/objective-see/deploy/downloads/LuLu_2.2.0.dmg

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/LuLu.app'
    requirement: anchor apple generic and identifier "com.objective-see.lulu.app" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VBG97UB4TA)

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/LuLu.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
