Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Installs the latest version of LuLu.
Identifier: com.github.autopkg-jby-recipes.install.LuLu
ParentRecipe: com.github.autopkg-jby-recipes.download.LuLu
MinimumVersion: 1.0.0

Input:
  NAME: LuLu

Process:
- Processor: InstallFromDMG
  Arguments:
    dmg_path: '%pathname%'
    items_to_copy:
    - destination_path: /Applications
      source_item: LuLu.app
