Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of LuLu and creates a package.
Identifier: com.github.autopkg-jby-recipes.pkg.LuLu
ParentRecipe: com.github.autopkg-jby-recipes.download.LuLu
MinimumVersion: 1.0.0

Input:
  NAME: LuLu

Process:
- Processor: AppPkgCreator
