Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of WhatsYourSign and creates a package.
Identifier: com.github.autopkg-jby-recipes.pkg.WhatsYourSign
ParentRecipe: com.github.autopkg-jby-recipes.download.WhatsYourSign
MinimumVersion: 1.0.0

Input:
  NAME: WhatsYourSign

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/WhatsYourSign.app'
